package game.droids.statsInfo;

public class StatsInfoOfBoss {
    public static String bossStats() {
        return "Статистика:\n" +
                "Тип дроїда:\t|Здоров'я:\t|Шкода:\t|Точність:\t|Шанс критичного удару:\t|Критична шкода:\t|Лікування:\n" +
                "Дракон\t\t|500\t|30\t\t\t|70\t\t\t|25%\t\t\t|80\t\t\t\t|-\n" +
                "Здібності:\n" +
                "Солдат: Збільшує свою точність до 100% і шанс критичного удару до 50%. Зменшує атаку усіх ворогів на 5 і наносить 20 здоров'я!\n";
    }
}
