package main;
import patient.Patient;
import java.lang.String;
import java.util.Scanner;

import static patient.PatientUtils.*;

public class Main
{
    public static void main(String[] args)
    {
        Scanner scan = new Scanner(System.in);
        System.out.print("Введіть к-сть хворих, які хочете занести до таблиці: ");
        int n = scan.nextInt();
        Patient[] patients = new Patient[n];

        for (int i = 0; i < n; i++)
            patients[i] = new Patient();

        firstTable(patients);
        secondTable(patients);
        thirdTable(patients);

        System.out.print(patients[0]);
    }
}

/*
Введіть к-сть хворих, які хочете занести до таблиці: 4

Хворий №1:
Введіть ПІБ хворого: Акімов Олександр Олегович

Введіть адресу хворого: Бандери 5

Введіть діагноз хворого: Гіпертонія

Введіть номер телефону хворого: 574389514

Введіть номер медичної картки хворого: 251



Хворий №2:
Введіть ПІБ хворого: Філяс Віталій Романович

Введіть адресу хворого: Мазепи 12

Введіть діагноз хворого: Сколіоз

Введіть номер телефону хворого: 592158295

Введіть номер медичної картки хворого: 985



Хворий №3:
Введіть ПІБ хворого: Іванчук Захар Іванович

Введіть адресу хворого: Грушевського 3

Введіть діагноз хворого: Сколіоз

Введіть номер телефону хворого: 482950182

Введіть номер медичної картки хворого: 547



Хворий №4:
Введіть ПІБ хворого: Лещук Віталій Олексійович

Введіть адресу хворого: Чорновола 17

Введіть діагноз хворого: Здоровий

Введіть номер телефону хворого: 478512987

Введіть номер медичної картки хворого: 762


Введіть діагноз, за яким хочете отримати таблицю: Сколіоз


 */